# /home/karlzipser/kzpy3/caf8/z2_color_aruco
# Monday, 19 Jun 2017, 06:43:41 PM
# /home/karlzipser/kzpy3/caf8/z2_color_aruco
# Monday, 19 Jun 2017, 06:43:41 PM

layer {
	name: "other_car_inverse_distances"
	type: "DummyData"
	top: "other_car_inverse_distances"
	dummy_data_param {
		shape {
			dim: 1
			dim: 11
		}
	}
}
	

layer {
	name: "marker_inverse_distances"
	type: "DummyData"
	top: "marker_inverse_distances"
	dummy_data_param {
		shape {
			dim: 1
			dim: 11
		}
	}
}
	

layer {
	name: "potential_values"
	type: "DummyData"
	top: "potential_values"
	dummy_data_param {
		shape {
			dim: 1
			dim: 11
		}
	}
}
	

layer {
	name: "clock_potential_values"
	type: "DummyData"
	top: "clock_potential_values"
	dummy_data_param {
		shape {
			dim: 1
			dim: 11
		}
	}
}
	

layer {
	name: "steer"
	type: "DummyData"
	top: "steer"
	dummy_data_param {
		shape {
			dim: 1
			dim: 1
		}
	}
}
	

layer {
	name: "motor"
	type: "DummyData"
	top: "motor"
	dummy_data_param {
		shape {
			dim: 1
			dim: 1
		}
	}
}
	

layer {
	name: "velocity"
	type: "DummyData"
	top: "velocity"
	dummy_data_param {
		shape {
			dim: 1
			dim: 1
		}
	}
}
	

layer {
	name: "metadata"
	type: "DummyData"
	top: "metadata"
	dummy_data_param {
		shape {
			dim: 1
			dim: 6
			dim: 14
			dim: 26
		}
	}
}
	

layer {
	name: "ZED_data_pool2"
	type: "DummyData"
	top: "ZED_data_pool2"
	dummy_data_param {
		shape {
			dim: 1
			dim: 12
			dim: 94
			dim: 168
		}
	}
}
	

layer {
  name: "ZED_data_pool2_scale"
  type: "Scale"
  bottom: "ZED_data_pool2"
  top: "ZED_data_pool2_scale"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 0.003921    }
    bias_term: true
    bias_filler {
      value: -0.5
    }
  }
}
	

layer {
	name: "conv1"
	type: "Convolution"
	bottom: "ZED_data_pool2_scale"
	top: "conv1"
	convolution_param {
		num_output: 96
		group: 1
		kernel_size: 11
		stride: 3
		pad_h: 0
		pad_w: 0
		weight_filler {
			type: "gaussian" 
			std: 0.00001
		}
	}
}
	

layer {
	name: "conv1_relu"
	type: "ReLU"
	bottom: "conv1"
	top: "conv1"
}
	

layer {
	name: "conv1_pool"
	type: "Pooling"
	bottom: "conv1"
	top: "conv1_pool"
	pooling_param {
		pool: MAX
		kernel_size: 3
		stride: 2
		pad_h: 0
		pad_w: 0
	}
}
	

layer {
	type: 'Concat'
	name: 'conv1_metadata_concat'
	bottom: "conv1_pool"
	bottom: "metadata"
	top: 'conv1_metadata_concat'
	concat_param {
		axis: 1
	}
}
		

layer {
	name: "conv2"
	type: "Convolution"
	bottom: "conv1_metadata_concat"
	top: "conv2"
	convolution_param {
		num_output: 256
		group: 2
		kernel_size: 3
		stride: 2
		pad_h: 0
		pad_w: 0
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}
	

layer {
	name: "conv2_relu"
	type: "ReLU"
	bottom: "conv2"
	top: "conv2"
}
	

layer {
	name: "conv2_pool"
	type: "Pooling"
	bottom: "conv2"
	top: "conv2_pool"
	pooling_param {
		pool: MAX
		kernel_size: 3
		stride: 2
		pad_h: 0
		pad_w: 0
	}
}
	

layer {
	name: "conv2_pool_drop"
	type: "Dropout"
	bottom: "conv2_pool"
	top: "conv2_pool"
	dropout_param {
		dropout_ratio: 0.0
	}
}
	

layer {
	name: "ip1"
	type: "InnerProduct"
	bottom: "conv2_pool"
	top: "ip1"
	inner_product_param {
		num_output: 512
		weight_filler {
			type: "xavier" 
		}
	}
}
	

layer {
	name: "ip1_relu"
	type: "ReLU"
	bottom: "ip1"
	top: "ip1"
}
	

layer {
	name: "ip_other_car_inverse_distances"
	type: "InnerProduct"
	bottom: "ip1"
	top: "ip_other_car_inverse_distances"
	inner_product_param {
		num_output: 11
		weight_filler {
			type: "xavier" 
		}
	}
}
	

layer {
	name: "euclidean_other_car_inverse_distances"
	type: "EuclideanLoss"
	bottom: "other_car_inverse_distances"
	bottom: "ip_other_car_inverse_distances"
	top: "euclidean_other_car_inverse_distances"
	loss_weight: 1
}
	

layer {
	name: "ip_marker_inverse_distances"
	type: "InnerProduct"
	bottom: "ip1"
	top: "ip_marker_inverse_distances"
	inner_product_param {
		num_output: 11
		weight_filler {
			type: "xavier" 
		}
	}
}
	

layer {
	name: "euclidean_marker_inverse_distances"
	type: "EuclideanLoss"
	bottom: "marker_inverse_distances"
	bottom: "ip_marker_inverse_distances"
	top: "euclidean_marker_inverse_distances"
	loss_weight: 1.0
}
	

layer {
	name: "ip_potential_values"
	type: "InnerProduct"
	bottom: "ip1"
	top: "ip_potential_values"
	inner_product_param {
		num_output: 11
		weight_filler {
			type: "xavier" 
		}
	}
}
	

layer {
	name: "euclidean_potential_values"
	type: "EuclideanLoss"
	bottom: "potential_values"
	bottom: "ip_potential_values"
	top: "euclidean_potential_values"
	loss_weight: 1.0
}
	

layer {
	name: "ip_clock_potential_values"
	type: "InnerProduct"
	bottom: "ip1"
	top: "ip_clock_potential_values"
	inner_product_param {
		num_output: 11
		weight_filler {
			type: "xavier" 
		}
	}
}
	

layer {
	name: "euclidean_clock_potential_values"
	type: "EuclideanLoss"
	bottom: "clock_potential_values"
	bottom: "ip_clock_potential_values"
	top: "euclidean_clock_potential_values"
	loss_weight: 1.0
}
	

layer {
	name: "ip_velocity"
	type: "InnerProduct"
	bottom: "ip1"
	top: "ip_velocity"
	inner_product_param {
		num_output: 1
		weight_filler {
			type: "xavier" 
		}
	}
}
	

layer {
	name: "euclidean_velocity"
	type: "EuclideanLoss"
	bottom: "velocity"
	bottom: "ip_velocity"
	top: "euclidean_velocity"
	loss_weight: 1.0
}
	

layer {
	type: 'Concat'
	name: 'ip_concat'
	bottom: "ip_other_car_inverse_distances"
	bottom: "ip_marker_inverse_distances"
	bottom: "ip_potential_values"
	bottom: "ip_clock_potential_values"
	bottom: "ip_velocity"
	top: 'ip_concat'
	concat_param {
		axis: 1
	}
}
		

layer {
	name: "ip2__steer"
	type: "InnerProduct"
	bottom: "ip_concat"
	top: "ip2__steer"
	inner_product_param {
		num_output: 20
		weight_filler {
			type: "xavier" 
		}
	}
}
	

layer {
	name: "ip2__steer_relu"
	type: "ReLU"
	bottom: "ip2__steer"
	top: "ip2__steer"
}
	

layer {
	name: "ip3_steer"
	type: "InnerProduct"
	bottom: "ip2__steer"
	top: "ip3_steer"
	inner_product_param {
		num_output: 1
		weight_filler {
			type: "xavier" 
		}
	}
}
	

layer {
	name: "ip2__motor"
	type: "InnerProduct"
	bottom: "ip_concat"
	top: "ip2__motor"
	inner_product_param {
		num_output: 20
		weight_filler {
			type: "xavier" 
		}
	}
}
	

layer {
	name: "ip2__motor_relu"
	type: "ReLU"
	bottom: "ip2__motor"
	top: "ip2__motor"
}
	

layer {
	name: "ip3_motor"
	type: "InnerProduct"
	bottom: "ip2__motor"
	top: "ip3_motor"
	inner_product_param {
		num_output: 1
		weight_filler {
			type: "xavier" 
		}
	}
}
	

layer {
	name: "euclidean_steer"
	type: "EuclideanLoss"
	bottom: "steer"
	bottom: "ip3_steer"
	top: "euclidean_steer"
	loss_weight: 1.0
}
	

layer {
	name: "euclidean_motor"
	type: "EuclideanLoss"
	bottom: "motor"
	bottom: "ip3_motor"
	top: "euclidean_motor"
	loss_weight: 1.0
}
	
